In [2]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

In [3]:
%matplotlib inline

In [10]:
gdp_df = pd.read_csv("../data/gdp_percapita.csv", nrows=6869)

In [11]:
gdp_df.head()

  Country or Area  Year        Value  Value Footnotes
0     Afghanistan  2019  2065.036398              NaN
1     Afghanistan  2018  2033.779002              NaN
2     Afghanistan  2017  2058.383832              NaN
3     Afghanistan  2016  2057.062164              NaN
4     Afghanistan  2015  2068.265904              NaN

In [8]:
internet_df=pd.read_csv('../data/internet_use.csv',nrows=4496)

In [9]:
internet_df.head()

  Country or Area  Year     Value  Value Footnotes
0     Afghanistan  2014  6.390000              NaN
1     Afghanistan  2013  5.900000              NaN
2     Afghanistan  2012  5.454545              NaN
3     Afghanistan  2011  5.000000              NaN
4     Afghanistan  2010  4.000000              NaN

7. Look at the shape of each DataFrame - how many rows? How many columns?

In [12]:
print(gdp_df.info())

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6869 entries, 0 to 6868
Data columns (total 4 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   Country or Area  6869 non-null   object
 1   Year             6869 non-null   object
 2   Value            6868 non-null   float64
 3   Value Footnotes  1 non-null      float64
dtypes: float64(2), object(2)
memory usage: 214.8+ KB
None

gdp_df has 6869 rows and 4 columns

In [13]:
print(internet_df.info())

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4496 entries, 0 to 4495
Data columns (total 4 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   Country or Area  4496 non-null   object
 1   Year             4496 non-null   object
 2   Value            4495 non-null   float64
 3   Value Footnotes  948 non-null    float64
dtypes: float64(2), object(2)
memory usage: 140.6+ KB
None

internet_df has 4496 rows and 4 columns

8. Both data frames have object (2 columns) and float64 (2 columns) data types.

9. Take a look at the last 10 rows of each DataFrame in turn.

In [33]:
last10_gdp_df = gdp_df.iloc[-10:]
print(last10_gdp_df)

     Country or Area      Year        Value  Value Footnotes
6859        Zimbabwe      1998  3653.920016              NaN
6860        Zimbabwe      1997  3580.048793              NaN
6861        Zimbabwe      1996  3520.430146              NaN
6862        Zimbabwe      1995  3226.413930              NaN
6863        Zimbabwe      1994  3263.934978              NaN
6864        Zimbabwe      1993  3033.504852              NaN
6865        Zimbabwe      1992  3054.889178              NaN
6866        Zimbabwe      1991  3426.598094              NaN
6867        Zimbabwe      1990  3324.348171              NaN
6868   footnoteSeqID  Footnote          NaN              NaN

In [34]:
last10_internet_df = internet_df.iloc[-10:]
print(last10_internet_df)

     Country or Area      Year     Value  Value Footnotes
4486        Zimbabwe      2001  0.799846              NaN
4487        Zimbabwe      2000  0.401434              NaN
4488        Zimbabwe      1999  0.161676              NaN
4489        Zimbabwe      1998  0.081648              NaN
4490        Zimbabwe      1997  0.033080              NaN
4491        Zimbabwe      1996  0.016790              NaN
4492        Zimbabwe      1995  0.007684              NaN
4493        Zimbabwe      1994  0.001739              NaN
4494        Zimbabwe      1990  0.000000              NaN
4495   footnoteSeqID  Footnote       NaN              NaN

10. Drop the value footnotes column from both DataFrames. Check that this worked as expected.

In [32]:
gdp_df_dropped = gdp_df.drop(['Value Footnotes'], axis = 1)
print(gdp_df_dropped)

     Country or Area      Year        Value
0        Afghanistan      2019  2065.036398
1        Afghanistan      2018  2033.779002
2        Afghanistan      2017  2058.383832
3        Afghanistan      2016  2057.062164
4        Afghanistan      2015  2068.265904
...              ...       ...          ...
6864        Zimbabwe      1993  3033.504852
6865        Zimbabwe      1992  3054.889178
6866        Zimbabwe      1991  3426.598094
6867        Zimbabwe      1990  3324.348171
6868   footnoteSeqID  Footnote          NaN

[6869 rows x 3 columns]

11. Change the columns for the GDP Per Capita DataFrame to ‘Country’, ‘Year’, and ‘GDP_Per_Capita’.